# Intro python data science
## Pr치ctica 05: pandas dataframe

Vamos a ver c칩mo:
* Punto 1: Crear dataframes
* Punto 2: Seleccionar elementos
* Punto 3: Ordenar columnas

# Punto 1:

In [1]:
# importar pandas
import pandas as pd

In [2]:
# datos de RRSS 2020
fbk = ['Facebook', 2449, True, 2006]
twt = ['Twitter', 339, False, 2006]
ig = ['Instagram', 1000, True, 2010]
yt = ['YouTube', 2000, False, 2005]
lkn = ['LinkedIn', 663, False, 2003]
wsp = ['WhatsApp', 1600, True, 2009]

In [5]:
lista_rrss = [fbk, twt, ig, yt, lkn, wsp]
lista_rrss

[['Facebook', 2449, True, 2006],
 ['Twitter', 339, False, 2006],
 ['Instagram', 1000, True, 2010],
 ['YouTube', 2000, False, 2005],
 ['LinkedIn', 663, False, 2003],
 ['WhatsApp', 1600, True, 2009]]

In [8]:
# crear dataframe a partir de listas
df_rrss=pd.DataFrame(lista_rrss,
                     columns=['Nombre', 'Cantidad', 'Es FB', 'A침o'])
df_rrss

      Nombre  Cantidad  Es FB   A침o
0   Facebook      2449   True  2006
1    Twitter       339  False  2006
2  Instagram      1000   True  2010
3    YouTube      2000  False  2005
4   LinkedIn       663  False  2003
5   WhatsApp      1600   True  2009

In [9]:
# crear dataframe vacio
df_vacio=pd.DataFrame(columns=['Nombre', 'Cantidad', 'Es FB', 'A침o'])
df_vacio

Empty DataFrame
Columns: [Nombre, Cantidad, Es FB, A침o]
Index: []

In [ ]:
# en proximos videos como crear dataframes a partir de csv o excel

# Punto 2:

In [ ]:
# seleccionar elementos: .loc vs .iloc

In [10]:
df_rrss

      Nombre  Cantidad  Es FB   A침o
0   Facebook      2449   True  2006
1    Twitter       339  False  2006
2  Instagram      1000   True  2010
3    YouTube      2000  False  2005
4   LinkedIn       663  False  2003
5   WhatsApp      1600   True  2009

In [17]:
# seleccionar un elemento por etiquetas
df_rrss.loc[1,'Nombre']

'Twitter'

In [21]:
# seleccionar un elemento por n칰mero
df_rrss.iloc[1,0]

'Twitter'

In [ ]:
# seleccionar por columnas/fila

In [23]:
df_rrss['Nombre']

0     Facebook
1      Twitter
2    Instagram
3      YouTube
4     LinkedIn
5     WhatsApp
Name: Nombre, dtype: object

In [24]:
df_rrss.iloc[4]

Nombre      LinkedIn
Cantidad         663
Es FB          False
A침o             2003
Name: 4, dtype: object

In [ ]:
# seleccionar por condicion booleana

In [25]:
df_rrss['Cantidad']>1500

0     True
1    False
2    False
3     True
4    False
5     True
Name: Cantidad, dtype: bool

In [26]:
df_rrss[df_rrss['Cantidad']>1500]

     Nombre  Cantidad  Es FB   A침o
0  Facebook      2449   True  2006
3   YouTube      2000  False  2005
5  WhatsApp      1600   True  2009

# Punto 3:

In [ ]:
# Como ordenar columnas

In [28]:
# ordenar modo ascendente: de menor a mayor
df_rrss.sort_values('Nombre', ascending=True)

      Nombre  Cantidad  Es FB   A침o
0   Facebook      2449   True  2006
2  Instagram      1000   True  2010
4   LinkedIn       663  False  2003
1    Twitter       339  False  2006
5   WhatsApp      1600   True  2009
3    YouTube      2000  False  2005

In [29]:
# ordenar descendente: de mayor a menor
df_rrss.sort_values('Nombre', ascending=False)

      Nombre  Cantidad  Es FB   A침o
3    YouTube      2000  False  2005
5   WhatsApp      1600   True  2009
1    Twitter       339  False  2006
4   LinkedIn       663  False  2003
2  Instagram      1000   True  2010
0   Facebook      2449   True  2006

In [ ]:
# ordenar por dos valores

In [30]:
# ordenar por dos columnas
df_rrss.sort_values(['A침o','Cantidad'],ascending=[True,False])

      Nombre  Cantidad  Es FB   A침o
4   LinkedIn       663  False  2003
3    YouTube      2000  False  2005
0   Facebook      2449   True  2006
1    Twitter       339  False  2006
5   WhatsApp      1600   True  2009
2  Instagram      1000   True  2010

# Gracias!
## Espero que te lleves algo 칰til de este notebook 游

Para m치s videos de programaci칩n para ciencia de datos

https://www.youtube.com/c/RafaGonzalezGouveia/

Si quieres realizar alguno de los cursos online de pago, ve a:

https://cursos.gonzalezgouveia.com